---
kind: method
id: M:Autodesk.Revit.DB.InsulationLiningBase.IsValidThickness(System.Double)
source: html/0d6d215a-ebb3-2352-eac8-51912d1293ac.htm
---
# Autodesk.Revit.DB.InsulationLiningBase.IsValidThickness Method

Identifies if the given thickness value is valid for assignment to insulation or lining elements.

## Syntax (C#)
```csharp
public static bool IsValidThickness(
	double thickness
)
```

## Parameters
- **thickness** (`System.Double`) - Thickness of the insulation and lining elements.

## Returns
True if the thickness is valid, false otherwise.